<template>
  <div id="china_map" style='width:100%; height:100%;' ref='tremap_chart'></div>
</template>

<script>
require('echarts-gl/dist/echarts-gl.min')
require('echarts-stat/dist/ecStat.min')
require('echarts/dist/echarts.min')
require('echarts/dist/extension/dataTool.min')
require('echarts-map/js/china')
require('echarts-map/js/world')
require('echarts/extension/bmap/bmap')
import {loadBMap} from "@/assets/js/util/map"
import axios from "axios"
import * as echarts from 'echarts';

export default {
  name: "TrajectoryMap",
  watch: {
    dataChange: function (val, oldVal) {
      this.initChart()
    }
  },
  props: {
    mapCenter: {
      type: Array,
      default: function () {
        return [104.114129, 37.550339]
      }
    },
    mapZoom: {
      type: Number,
      default: 5
    },
    mapCoords: {
      type: Object,
      default: function () {
        return {
          coords: [
            [120.395645, 43.929986],
            [118.210813, 39.14393],
            [114.822082, 36.248958],
            [110.350864, 34.190277],
            [111, 39.890277],
            [100, 41.828319]
          ]
        }
      }
    },
    mapData: {
      type: Object,
      default: function () {
        return {
          data: [
            {name: '西城区', value: 120.38},
            {name: '朝阳区', value: 90.77},
            {name: '丰台区', value: 121.65},
            {name: '海淀区', value: 107.75},
            {name: '门头沟区', value: 78.25},
            {name: '房山区', value: 97.25},
            {name: '通州区', value: 104.15},
            {name: '顺义区', value: 111.55},
            {name: '昌平区', value: 91.54},
            {name: '大兴区', value: 133.41},
            {name: '怀柔区', value: 71.13},
            {name: '平谷区', value: 95.15},
            {name: '密云区', value: 78.33},
            {name: '延庆区', value: 70.0},
            {name: '和平区', value: 23.69},
            {name: '河东区', value: 108.04},
            {name: '东丽区', value: 120.6},
            {name: '西青区', value: 127.33},
            {name: '津南区', value: 114.62},
            {name: '北辰区', value: 131.63},
            {name: '武清区', value: 128.15},
            {name: '宝坻区', value: 124.77},
            {name: '滨海新区', value: 110.0},
            {name: '宁河区', value: 119.92},
            {name: '静海区', value: 118.81},
            {name: '蓟州区', value: 111.05},
            {name: '石家庄', value: 145.14},
            {name: '保定', value: 124.04},
            {name: '沧州', value: 127.33},
            {name: '承德', value: 54.96},
            {name: '邯郸', value: 152.0},
            {name: '衡水', value: 149.53},
            {name: '廊坊', value: 128.83},
            {name: '秦皇岛', value: 83.36},
            {name: '唐山', value: 110.79},
            {name: '邢台', value: 161.29},
            {name: '张家口', value: 53.79},
            {name: '太原', value: 76.68},
            {name: '长治', value: 95.41},
            {name: '大同', value: 64.32},
            {name: '晋城', value: 104.58},
            {name: '晋中', value: 88.03},
            {name: '临汾', value: 83.27},
            {name: '吕梁', value: 68.45},
            {name: '朔州', value: 62.14},
            {name: '忻州', value: 58.64},
            {name: '阳泉', value: 86.19},
            {name: '运城', value: 106.87},
            {name: '呼和浩特', value: 71.81},
            {name: '阿拉善盟', value: 32.13},
            {name: '包头', value: 46.67},
            {name: '巴彦淖尔', value: 31.93},
            {name: '赤峰', value: 31.37},
            {name: '鄂尔多斯', value: 46.58},
            {name: '呼伦贝尔', value: 18.86},
            {name: '通辽', value: 32.78},
            {name: '乌海', value: 61.44},
            {name: '乌兰察布', value: 45.56},
            {name: '锡林郭勒盟', value: 26.39},
            {name: '兴安盟', value: 21.22}
          ],
          geoCoordMap: {
            '西城区': [116.366794, 39.915309],
            '朝阳区': [116.486409, 39.921489],
            '丰台区': [116.286968, 39.863642],
            '海淀区': [116.310316, 39.956074],
            '门头沟区': [116.105381, 39.937183],
            '房山区': [116.139157, 39.735535],
            '通州区': [116.658603, 39.902486],
            '顺义区': [116.653525, 40.128936],
            '昌平区': [116.235906, 40.218085],
            '大兴区': [116.338033, 39.728908],
            '怀柔区': [116.637122, 40.324272],
            '平谷区': [117.112335, 40.144783],
            '密云区': [116.843352, 40.377362],
            '延庆区': [115.985006, 40.465325],
            '和平区': [117.195907, 39.118327],
            '河东区': [117.226568, 39.122125],
            '东丽区': [117.313967, 39.087764],
            '西青区': [117.012247, 39.139446],
            '津南区': [117.382549, 38.989577],
            '北辰区': [117.13482, 39.225555],
            '武清区': [117.057959, 39.376925],
            '宝坻区': [117.308094, 39.716965],
            '滨海新区': [117.654173, 39.032846],
            '宁河区': [117.82828, 39.328886],
            '静海区': [116.925304, 38.935671],
            '蓟州区': [117.407449, 40.045342],
            '石家庄': [114.522082, 38.048958],
            '保定': [115.49481, 38.886565],
            '沧州': [116.863806, 38.297615],
            '承德': [117.933822, 40.992521],
            '邯郸': [114.482694, 36.609308],
            '衡水': [115.686229, 37.746929],
            '廊坊': [116.703602, 39.518611],
            '秦皇岛': [119.604368, 39.945462],
            '唐山': [118.183451, 39.650531],
            '邢台': [114.520487, 37.069531],
            '张家口': [114.893782, 40.811188],
            '太原': [112.550864, 37.890277],
            '长治': [113.120292, 36.201664],
            '大同': [113.290509, 40.113744],
            '晋城': [112.867333, 35.499834],
            '晋中': [112.738514, 37.693362],
            '临汾': [111.538788, 36.099745],
            '吕梁': [111.143157, 37.527316],
            '朔州': [112.479928, 39.337672],
            '忻州': [112.727939, 38.461031],
            '阳泉': [113.569238, 37.869529],
            '运城': [111.006854, 35.038859],
            '呼和浩特': [111.660351, 40.828319],
            '阿拉善盟': [105.695683, 38.843075],
            '包头': [109.846239, 40.647119],
            '巴彦淖尔': [107.423807, 40.76918],
            '赤峰': [118.930761, 42.297112],
            '鄂尔多斯': [109.993706, 39.81649],
            '呼伦贝尔': [119.760822, 49.201636],
            '通辽': [122.260363, 43.633756],
            '乌海': [106.831999, 39.683177],
            '乌兰察布': [113.112846, 41.022363],
            '锡林郭勒盟': [116.02734, 43.939705],
            '兴安盟': [122.048167, 46.083757]
          },
        }
      }
    },
    aqiValue: {
      type: Number,
      default: 45.06
    },
    pointData: {
      type: Object,
      default: function () {
        return {
          data1: [
            {
              'name': '中国石油天然气集团公司',
              'value': 97.25
            },
            {
              'name': '大庆油田有限责任公司',
              'value': 68.34
            },
            {
              'name': '辽河油田',
              'value': 83.58
            },
            {
              'name': '中国石油天然气股份有限公司长庆油田分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司塔里木油田分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司新疆油田分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司西南油气田分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司吉林油田分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司大港油田分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司青海油田分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司吐哈油田分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司华北油田分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司冀东油田分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司玉门油田分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司浙江油田分公司',
              'value': 97.25
            },
            {
              'name': '中石油煤层气有限责任公司',
              'value': 102.69
            },
            {
              'name': '南方石油勘探开发有限责任公司',
              'value': 100.23
            },
            {
              'name': '中国石油天然气股份有限公司大庆石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司吉林石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司抚顺石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司辽阳石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司兰州石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司独山子石化分公司',
              'value': 97.25
            },
            {
              'name': '乌鲁木齐石化分公司',
              'value': 51.73
            },
            {
              'name': '中国石油天然气股份有限公司宁夏石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司大连石化分公司',
              'value': 97.25
            },
            {
              'name': '大连西太平洋石油化工有限公司',
              'value': 68.48
            },
            {
              'name': '中国石油天然气股份有限公司锦州石化分公司',
              'value': 97.25
            },
            {
              'name': '四川石化有限责任公司锦西石化分公司',
              'value': 105.15
            },
            {
              'name': '中国石油天然气股份有限公司大庆炼化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司哈尔滨石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司广西石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司四川石化有限责任公司',
              'value': 90.77
            },
            {
              'name': '中国石油天然气股份有限公司广东石化项目筹备组',
              'value': 90.77
            },
            {
              'name': '中国石油天然气股份有限公司大港石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司华北石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司呼和浩特石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司辽河石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司长庆石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司克拉玛依石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司庆阳石化分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司炼化工程建设项目部',
              'value': 90.77
            },
            {
              'name': '中国石油天然气股份有限公司东北化工销售分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司西北化工销售分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司华北化工销售分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司华东化工销售分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司华南化工销售分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司西南化工销售分公司',
              'value': 97.25
            },
            {
              'name': '北京油气调控中心',
              'value': 90.77
            },
            {
              'name': '中国石油天然气股份有限公司管道建设项目经理部',
              'value': 90.77
            },
            {
              'name': '中国石油天然气股份有限公司管道公司',
              'value': 90.77
            },
            {
              'name': '中国石油天然气股份有限公司西气东输管道分公司',
              'value': 97.25
            },
            {
              'name': '北京天然气管道有限公司',
              'value': 70.0
            },
            {
              'name': '中国石油天然气股份有限公司西部管道分公司',
              'value': 97.25
            },
            {
              'name': '中国石油天然气股份有限公司西南管道分公司筹备组',
              'value': 97.25
            },
            {
              'name': '昆仑燃气有限公司',
              'value': 67.46
            },
            {
              'name': '昆仑能源有限公司',
              'value': 90.77
            },
            {
              'name': '昆仑天然气利用有限公司',
              'value': 68.17
            },
            {
              'name': '中国石油天然气股份有限公司华北天然气销售分公司',
              'value': 97.25
            },
            {
              'name': '公司京唐液化天然气有限公司',
              'value': 98.78
            },
            {
              'name': '大连液化天然气有限公司',
              'value': 96.52
            },
            {
              'name': '江苏液化天然气有限公司',
              'value': 100.72
            },
            {
              'name': '中国石油化工集团公司',
              'value': 111.23
            },
            {
              'name': '胜利油田分公司',
              'value': 110.56
            },
            {
              'name': '中原油田分公司',
              'value': 147.91
            },
            {
              'name': '河南油田分公司',
              'value': 126.72
            },
            {
              'name': '江汉油田分公司',
              'value': 72.34
            },
            {
              'name': '江苏油田分公司',
              'value': 92.55
            },
            {
              'name': '南方勘探开发分公司',
              'value': 95.23
            },
            {
              'name': '上海海洋油气分公司',
              'value': 67.46
            },
            {
              'name': '西北油田分公司',
              'value': 29.88
            },
            {
              'name': '西南分公司',
              'value': 118.97
            },
            {
              'name': '华东分公司',
              'value': 83.34
            },
            {
              'name': '华北分公司',
              'value': 121.65
            },
            {
              'name': '东北分公司',
              'value': 23.69
            },
            {
              'name': '中南分公司',
              'value': 65.89
            },
            {
              'name': '天然气分公司',
              'value': 90.77
            },
            {
              'name': '中国石化西部新区勘探指挥部',
              'value': 120.38
            },
            {
              'name': '石家庄炼化分公司',
              'value': 197.8
            },
            {
              'name': '北京燕山分公司',
              'value': 97.25
            },
            {
              'name': '齐鲁分公司',
              'value': 124.36
            },
            {
              'name': '上海高桥分公司',
              'value': 67.46
            },
            {
              'name': '金陵分公司',
              'value': 95.15
            },
            {
              'name': '茂名分公司',
              'value': 53.75
            },
            {
              'name': '天津分公司',
              'value': 110.0
            },
            {
              'name': '巴陵分公司',
              'value': 79.82
            },
            {
              'name': '长岭分公司',
              'value': 48.67
            },
            {
              'name': '广州分公司',
              'value': 68.51
            },
            {
              'name': '安庆分公司',
              'value': 105.47
            },
            {
              'name': '荆门分公司',
              'value': 107.01
            },
            {
              'name': '洛阳分公司',
              'value': 147.58
            },
            {
              'name': '九江分公司',
              'value': 87.18
            },
            {
              'name': '湖北化肥分公司',
              'value': 70.0
            },
            {
              'name': '济南分公司',
              'value': 137.66
            },
            {
              'name': '武汉分公司',
              'value': 120.46
            },
            {
              'name': '沧州分公司',
              'value': 127.22
            },
            {
              'name': '润滑油分公司',
              'value': 53.75
            },
            {
              'name': '管道储运分公司',
              'value': 109.55
            },
            {
              'name': '北海分公司',
              'value': 100.23
            },
            {
              'name': '催化剂分公司',
              'value': 97.25
            },
            {
              'name': '塔河分公司',
              'value': 18.55
            },
            {
              'name': '西安分公司',
              'value': 136.45
            },
            {
              'name': '天津石油分公司',
              'value': 114.62
            },
            {
              'name': '安徽石油分公司',
              'value': 105.47
            },
            {
              'name': '北京石油分公司',
              'value': 111.55
            },
            {
              'name': '福建石油分公司',
              'value': 131.63
            },
            {
              'name': '广东石油分公司',
              'value': 123.45
            },
            {
              'name': '广西石油分公司',
              'value': 81.36
            },
            {
              'name': '贵州石油分公司',
              'value': 64.16
            },
            {
              'name': '海南石油分公司',
              'value': 24.66
            },
            {
              'name': '河北石油分公司',
              'value': 132.56
            },
            {
              'name': '河南石油分公司',
              'value': 24.92
            },
            {
              'name': '湖北石油分公司',
              'value': 123.45
            },
            {
              'name': '湖南石油分公司',
              'value': 136.67
            },
            {
              'name': '江苏石油分公司',
              'value': 94.11
            },
            {
              'name': '江西石油分公司',
              'value': 99.92
            },
            {
              'name': '山东石油分公司',
              'value': 118.74
            },
            {
              'name': '山西石油分公司',
              'value': 110.76
            },
            {
              'name': '上海石油分公司',
              'value': 67.46
            },
            {
              'name': '深圳石油分公司',
              'value': 64.01
            },
            {
              'name': '云南石油分公司',
              'value': 71.5
            },
            {
              'name': '浙江石油分公司',
              'value': 71.87
            },
            {
              'name': '辽宁石油分公司',
              'value': 100.23
            },
            {
              'name': '四川石油分公司',
              'value': 105.15
            },
            {
              'name': '重庆石油分公司',
              'value': 89.69
            },
            {
              'name': '陕西石油分公司',
              'value': 75.22
            },
            {
              'name': '内蒙古石油分公司',
              'value': 71.87
            },
            {
              'name': '新疆石油分公司',
              'value': 120.38
            },
            {
              'name': '吉林石油分公司',
              'value': 71.7
            },
            {
              'name': '黑龙江石油分公司',
              'value': 85.73
            },
            {
              'name': '青海石油分公司',
              'value': 100.23
            },
            {
              'name': '甘肃石油分公司',
              'value': 89.79
            },
            {
              'name': '宁夏石油分公司\xa0',
              'value': 111.29
            }
          ],
          data2:  {
            '中国石油天然气集团公司': [116.01912387659344, 39.709299746729386],
            '大庆油田有限责任公司': [124.92065199248033, 46.62170247618628],
            '辽河油田': [122.91411165573811, 41.53343917254981],
            '中国石油天然气股份有限公司长庆油田分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司塔里木油田分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司新疆油田分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司西南油气田分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司吉林油田分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司大港油田分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司青海油田分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司吐哈油田分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司华北油田分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司冀东油田分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司玉门油田分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司浙江油田分公司': [116.01912387659344, 39.709299746729386],
            '中石油煤层气有限责任公司': [112.60613758471195, 37.74166878282097],
            '南方石油勘探开发有限责任公司': [120.18115907390077, 30.24731085615178],
            '中国石油天然气股份有限公司大庆石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司吉林石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司抚顺石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司辽阳石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司兰州石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司独山子石化分公司': [116.01912387659344, 39.709299746729386],
            '乌鲁木齐石化分公司': [87.6985113331356, 43.96641551284898],
            '中国石油天然气股份有限公司宁夏石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司大连石化分公司': [116.01912387659344, 39.709299746729386],
            '大连西太平洋石油化工有限公司': [121.86081323171297, 38.99423431448455],
            '中国石油天然气股份有限公司锦州石化分公司': [116.01912387659344, 39.709299746729386],
            '四川石化有限责任公司锦西石化分公司': [104.6494037048691, 28.75800702855183],
            '中国石油天然气股份有限公司大庆炼化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司哈尔滨石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司广西石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司四川石化有限责任公司': [116.44157539860383, 39.95201121539695],
            '中国石油天然气股份有限公司广东石化项目筹备组': [116.44157539860383, 39.95201121539695],
            '中国石油天然气股份有限公司大港石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司华北石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司呼和浩特石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司辽河石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司长庆石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司克拉玛依石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司庆阳石化分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司炼化工程建设项目部': [116.44157539860383, 39.95201121539695],
            '中国石油天然气股份有限公司东北化工销售分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司西北化工销售分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司华北化工销售分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司华东化工销售分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司华南化工销售分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司西南化工销售分公司': [116.01912387659344, 39.709299746729386],
            '北京油气调控中心': [116.43928265345072, 39.94888436347234],
            '中国石油天然气股份有限公司管道建设项目经理部': [116.44157539860383, 39.95201121539695],
            '中国石油天然气股份有限公司管道公司': [116.44157539860383, 39.95201121539695],
            '中国石油天然气股份有限公司西气东输管道分公司': [116.01912387659344, 39.709299746729386],
            '北京天然气管道有限公司': [115.92277800556232, 40.394853032338965],
            '中国石油天然气股份有限公司西部管道分公司': [116.01912387659344, 39.709299746729386],
            '中国石油天然气股份有限公司西南管道分公司筹备组': [116.01912387659344, 39.709299746729386],
            '昆仑燃气有限公司': [121.53786269917639, 31.231518689021847],
            '昆仑能源有限公司': [116.41262804252811, 40.00181004952795],
            '昆仑天然气利用有限公司': [122.15866187440093, 37.420116774277126],
            '中国石油天然气股份有限公司华北天然气销售分公司': [116.01912387659344, 39.709299746729386],
            '公司京唐液化天然气有限公司': [120.17094695720223, 30.375708987470908],
            '大连液化天然气有限公司': [121.62163148459285, 38.9189536667856],
            '江苏液化天然气有限公司': [118.76955164466914, 32.066776944293416],
            '中国石油化工集团公司': [116.39472292727267, 39.95803130459444],
            '胜利油田分公司': [118.49465210267513, 37.46829084447717],
            '中原油田分公司': [115.34913780350895, 35.82130342439147],
            '河南油田分公司': [112.61829327521188, 32.690797188055726],
            '江汉油田分公司': [107.27794560759958, 29.75938048205549],
            '江苏油田分公司': [119.4176173565297, 32.38708071173744],
            '南方勘探开发分公司': [122.08882760405525, 41.122443748048774],
            '上海海洋油气分公司': [121.53595128471225, 31.241642724142658],
            '西北油田分公司': [84.2679676600616, 41.788652889206105],
            '西南分公司': [104.07480619029096, 30.550791922573957],
            '华东分公司': [121.45488100904777, 31.068600836198296],
            '华北分公司': [116.30552640030382, 39.83550246209148],
            '东北分公司': [123.39744188114301, 41.738283299983685],
            '中南分公司': [120.2994462366742, 31.54406006402177],
            '天然气分公司': [116.43188160418457, 39.99105682578654],
            '中国石化西部新区勘探指挥部': [116.38738044752577, 39.88145834832466],
            '石家庄炼化分公司': [114.69923532637215, 37.99973483743079],
            '北京燕山分公司': [115.99723288995969, 39.73856056043073],
            '齐鲁分公司': [117.95108636062088, 36.67077495962622],
            '上海高桥分公司': [121.56832001698385, 31.338034863465424],
            '金陵分公司': [117.1081526717696, 40.31741725102371],
            '茂名分公司': [110.931542579969, 21.669064031332095],
            '天津分公司': [117.8180380620464, 39.031214457303676],
            '巴陵分公司': [113.1699711507022, 29.41011863754646],
            '长岭分公司': [123.9743741033988, 44.28163828005157],
            '广州分公司': [113.37331697570669, 22.98471164422369],
            '安庆分公司': [117.09824795521659, 30.542237904379125],
            '荆门分公司': [112.20639298023002, 31.041732575569622],
            '洛阳分公司': [112.4539022889193, 34.624047343982824],
            '九江分公司': [115.97859653861954, 29.706910013852095],
            '湖北化肥分公司': [115.99944703338069, 40.465236029816914],
            '济南分公司': [116.91851983962997, 36.696173862856924],
            '武汉分公司': [112.15917166465647, 32.05142570158253],
            '沧州分公司': [116.8308630083052, 38.29665571607656],
            '润滑油分公司': [110.90876074376853, 21.687694911130915],
            '管道储运分公司': [114.38943904074037, 30.597118802636235],
            '北海分公司': [109.11311486384571, 21.473514218700252],
            '催化剂分公司': [115.99723288995969, 39.73856056043073],
            '塔河分公司': [124.71651251448932, 52.34030508111336],
            '西安分公司': [108.87897379156543, 34.259160237347736],
            '天津石油分公司': [117.41646217195182, 38.995705092347684],
            '安徽石油分公司': [117.06360390491879, 30.53095656804304],
            '北京石油分公司': [116.62426702406788, 40.04802309621132],
            '福建石油分公司': [117.1422858557239, 39.229162080290905],
            '广东石油分公司': [113.39942236263188, 22.5223146707905],
            '广西石油分公司': [110.18619487315159, 25.24169878354397],
            '贵州石油分公司': [104.91249214626991, 25.09396734941651],
            '海南石油分公司': [100.62662114445924, 36.2921024798988],
            '河北石油分公司': [117.20359278135501, 39.15348514470478],
            '河南石油分公司': [101.62247338027404, 34.740396071091155],
            '湖北石油分公司': [114.27692636544619, 30.596594778072472],
            '湖南石油分公司': [117.12639941261048, 36.65655420178723],
            '江苏石油分公司': [120.632869035185, 31.278485972035682],
            '江西石油分公司': [104.8374375648582, 30.538218972179482],
            '山东石油分公司': [117.9774040171467, 37.3881961960769],
            '山西石油分公司': [113.12255886984902, 36.2012683721548],
            '上海石油分公司': [121.49540878077482, 31.24568289287693],
            '深圳石油分公司': [114.14692007385615, 22.56865268476035],
            '云南石油分公司': [103.72351177196889, 27.34408386024681],
            '浙江石油分公司': [113.2661739216338, 23.21033029637662],
            '辽宁石油分公司': [123.45536506957916, 41.838941723594814],
            '四川石油分公司': [104.6494037048691, 28.75800702855183],
            '重庆石油分公司': [106.58074420152344, 29.56262834898062],
            '陕西石油分公司': [108.95438608997532, 34.26801925929182],
            '内蒙古石油分公司': [113.23525649175433, 23.192427338700643],
            '新疆石油分公司': [116.37749100216642, 39.88624710609514],
            '吉林石油分公司': [126.55563450495482, 43.84356783457924],
            '黑龙江石油分公司': [126.61394278726681, 45.75196133634989],
            '青海石油分公司': [118.72231532739357, 32.00050491826547],
            '甘肃石油分公司': [98.29620384300111, 39.77796014739059],
            '宁夏石油分公司\xa0': [120.41180961359262, 36.08524139986461]
          },
        }
      }
    }
  },
  mounted() {
    this.$nextTick(() => {
      this.initChart()
    })
  },
  data() {
    return {
      myChart: ''
    }
  },
  methods: {
    initChart() {
      loadBMap("m6R4RiIh4QQ6mxyNk14NcjUNSmWOt8h9").then(() => {
        if (this.myChart != null && this.myChart != "" && this.myChart != undefined) {
          this.myChart.dispose();
        }
        this.myChart = this.$echarts.init(this.$refs.tremap_chart)
        let coords = this.mapCoords.coords

        // 热力图
        let myConvertData = function (data, val) {
          let res = []
          for (let i = 0; i < data.length; i++) {
            if (data[i]['province'] == 1) {
              if (data[i]["aqi"] >= 45.06) {
                // console.log('---------');
                res.push({
                  value: [parseFloat(data[i]["lon"]), parseFloat(data[i]["lat"]), parseFloat(data[i]["aqi"]) - val]
                });
              } else {
                res.push({
                  value: [parseFloat(data[i]["lon"]), parseFloat(data[i]["lat"]), parseFloat(data[i]["aqi"])]
                });
              }
            } else {
              res.push({
                value: [parseFloat(data[i]["lon"]), parseFloat(data[i]["lat"]), parseFloat(data[i]["aqi"]) - val]
              });
            }
          }
          return res
        }
        var convertData = (data, val) => {
          var res = [];
          for (var i = 0; i < data.length; i++) {
            var geoCoord = this.mapData.geoCoordMap[data[i].name];
            if (geoCoord) {
              if (this.mapZoom == 5) {
                res.push({
                  name: data[i].name,
                  value: geoCoord.concat(data[i].value)
                });
              } else {
                if (data[i].value > this.aqiValue) {
                  res.push({
                    name: data[i].name,
                    value: geoCoord.concat(parseFloat((data[i].value - (data[i].value - this.aqiValue) / val).toFixed(2)))
                  });
                } else {
                  res.push({
                    name: data[i].name,
                    value: geoCoord.concat(data[i].value)
                  });
                }
              }
            }
          }
          return res;
        }

        function renderItem(params, api) {
          var points = [];
          for (var i = 0; i < coords.length; i++) {
            points.push(api.coord(coords[i]));
          }
          var color = api.visual('color');

          return {
            type: 'polygon',
            shape: {
              points: echarts.graphic.clipPointsByRect(points, {
                x: params.coordSys.x,
                y: params.coordSys.y,
                width: params.coordSys.width,
                height: params.coordSys.height
              })
            },
            style: api.style({
              fill: color,
              stroke: echarts.color.lift(color)
            })
          };
        }

        var option;

        var pointConvertData = data => {
          var res = [];
          for (var i = 0; i < data.length; i++) {
            var geoCoord = this.pointData.data2[data[i].name];
            if (geoCoord) {
              res.push({
                name: data[i].name,
                value: geoCoord.concat(data[i].value)
              });
            }
          }
          return res;
        }

        axios({
          url: './2013.json'
        }).then(res => {
          option = {
            baseOption: {
              tooltip: {
                trigger: 'item'
              },
              timeline: {
                axisType: 'category',
                bottom: '6%',
                autoPlay: false,
                playInterval: 5000,
                data: ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']
              },
              visualMap: {
                type: 'piecewise',
                min: 0,
                max: 350,
                //分段数量
                splitNumber: 6,
                pieces: [
                  {min: 0, max: 50},
                  {min: 51, max: 100},
                  {min: 101, max: 150},
                  {min: 151, max: 200},
                  {min: 201, max: 300},
                  {min: 301},
                ],
                inRange: {
                  color: ['#4B6F55', '#F4E925', '#F5AF58', '#F04D31', '#E855E8', '#791A27']
                },
                textStyle: {
                  color: '#fff',
                  fontWeight: 'bolder'
                },
                calculable: false,
                bottom: 10,
                left: 'right',
                right: 1
              },
              bmap: {
                center: this.mapCenter,
                zoom: this.mapZoom,
                roam: true,
                mapStyle: {
                  'styleJson': [{
                    'featureType': 'water',
                    'elementType': 'all',
                    'stylers': {
                      "color": "#141D4C"
                    }
                  }, {
                    'featureType': 'land',
                    'elementType': 'all',
                    'stylers': {
                      'color': '#0F2842'
                    }
                  }, {
                    'featureType': 'railway',
                    'elementType': 'all',
                    'stylers': {
                      'visibility': 'off'
                    }
                  }, {
                    'featureType': 'highway',
                    'elementType': 'all',
                    'stylers': {
                      // 'color': '#fdfdfd'
                      'visibility': 'off'
                    }
                  }, {
                    'featureType': 'highway',
                    'elementType': 'labels',
                    'stylers': {
                      'visibility': 'off'
                    }
                  }, {
                    'featureType': 'arterial',
                    'elementType': 'geometry',
                    'stylers': {
                      'color': '#fefefe'
                    }
                  }, {
                    'featureType': 'arterial',
                    'elementType': 'geometry.fill',
                    'stylers': {
                      'color': '#fefefe'
                    }
                  }, {
                    'featureType': 'poi',
                    'elementType': 'all',
                    'stylers': {
                      'visibility': 'off'
                    }
                  }, {
                    'featureType': 'green',
                    'elementType': 'all',
                    'stylers': {
                      'visibility': 'off'
                    }
                  }, {
                    'featureType': 'subway',
                    'elementType': 'all',
                    'stylers': {
                      'visibility': 'off'
                    }
                  }, {
                    'featureType': 'manmade',
                    'elementType': 'all',
                    'stylers': {
                      'color': '#d1d1d1'
                    }
                  }, {
                    'featureType': 'local',
                    'elementType': 'all',
                    'stylers': {
                      'color': '#d1d1d1'
                    }
                  }, {
                    'featureType': 'arterial',
                    'elementType': 'labels',
                    'stylers': {
                      'visibility': 'off'
                    }
                  }, {
                    'featureType': 'boundary',
                    'elementType': 'all',
                    'stylers': {
                      'color': '#189aeaff'
                    }
                  }, {
                    'featureType': 'building',
                    'elementType': 'all',
                    'stylers': {
                      'color': '#d1d1d1'
                    }
                  }, {
                    'featureType': 'label',
                    'elementType': 'labels.text.fill',
                    'stylers': {
                      'color': '#999999'
                    }
                  }, {
                    "featureType": "districtlabel",
                    "elementType": "all",
                    "stylers": {
                      "color": "#0F2842",
                    }
                  }, {
                    "featureType": "boundary",
                    "elementType": "geometry.stroke",
                    "stylers": {
                      "color": "#FC0308"
                    }
                  }]
                }
              },
              series: [
                {
                  name: 'AQI',
                  type: 'scatter',
                  coordinateSystem: 'bmap',
                  // data: convertData(this.mapData.data),
                  symbol: 'pin',
                  symbolSize: 40,
                  encode: {
                    value: 2
                  },
                  showEffectOn: 'render',
                  rippleEffect: {
                    brushType: 'stroke'
                  },
                  label: {
                    normal: {
                      show: true,
                      textStyle: {
                        color: '#fff',
                        fontSize: 9,
                      },
                      formatter(value) {
                        return value.data.value[2]
                      }
                    },
                  },
                  itemStyle: {
                    color: '#D8BC37', //标志颜色
                  },
                  emphasis: {
                    label: {
                      show: true
                    }
                  }
                },
                {
                  type: 'heatmap',
                  coordinateSystem: 'bmap',
                  pointSize: 2.4,
                  // data: myConvertData(res.data),
                  blurSize: 5
                },
                {
                  type: 'custom',
                  coordinateSystem: 'bmap',
                  // renderItem: renderItem,
                  itemStyle: {
                    opacity: 0.5
                  },
                  animation: false,
                  silent: true,
                  data: [0],
                  z: -10
                },
                {
                  name: 'AQI',
                  type: 'effectScatter',
                  coordinateSystem: 'bmap',
                  // data: convertData(data),
                  symbolSize: function (val) {
                    return val[2] / 10;
                  },
                  encode: {
                    value: 2
                  },
                  label: {
                    formatter: '{b}',
                    position: 'right',
                    show: false
                  },
                  color: 'red',
                  emphasis: {
                    label: {
                      show: true
                    }
                  }
                },
              ]
            },
            options: [
              {
                series: [
                  {
                    data: convertData(this.mapData.data, 12)
                  },
                  {
                    data: myConvertData(res.data, ((this.aqiValue - 45.06) / 12) * 1)
                  },
                  {
                    renderItem: renderItem
                  },
                  {
                    data: pointConvertData(this.pointData.data1)
                  }
                ]
              },
              {
                series: [
                  {
                    data: convertData(this.mapData.data, 11)
                  },
                  {
                    data: myConvertData(res.data, ((this.aqiValue - 45.06) / 12) * 2)
                  },
                  {
                    renderItem: renderItem
                  },
                  {
                    data: pointConvertData(this.pointData.data1)
                  }
                ]
              },
              {
                series: [
                  {
                    data: convertData(this.mapData.data, 10)
                  },
                  {
                    data: myConvertData(res.data, ((this.aqiValue - 45.06) / 12) * 3)
                  },
                  {
                    renderItem: renderItem
                  },
                  {
                    data: pointConvertData(this.pointData.data1)
                  }
                ]
              },
              {
                series: [
                  {
                    data: convertData(this.mapData.data, 9)
                  },
                  {
                    data: myConvertData(res.data, ((this.aqiValue - 45.06) / 12) * 4)
                  },
                  {
                    renderItem: renderItem
                  },
                  {
                    data: pointConvertData(this.pointData.data1)
                  }
                ]
              },
              {
                series: [
                  {
                    data: convertData(this.mapData.data, 8)
                  },
                  {
                    data: myConvertData(res.data, ((this.aqiValue - 45.06) / 12) * 5)
                  },
                  {
                    renderItem: renderItem
                  },
                  {
                    data: pointConvertData(this.pointData.data1)
                  }
                ]
              },
              {
                series: [
                  {
                    data: convertData(this.mapData.data, 7)
                  },
                  {
                    data: myConvertData(res.data, ((this.aqiValue - 45.06) / 12) * 6)
                  },
                  {
                    renderItem: renderItem
                  },
                  {
                    data: pointConvertData(this.pointData.data1)
                  }
                ]
              },
              {
                series: [
                  {
                    data: convertData(this.mapData.data, 6)
                  },
                  {
                    data: myConvertData(res.data, ((this.aqiValue - 45.06) / 12) * 7)
                  },
                  {
                    renderItem: renderItem
                  },
                  {
                    data: pointConvertData(this.pointData.data1)
                  }
                ]
              },
              {
                series: [
                  {
                    data: convertData(this.mapData.data, 5)
                  },
                  {
                    data: myConvertData(res.data, ((this.aqiValue - 45.06) / 12) * 8)
                  },
                  {
                    renderItem: renderItem
                  },
                  {
                    data: pointConvertData(this.pointData.data1)
                  }
                ]
              },
              {
                series: [
                  {
                    data: convertData(this.mapData.data, 4)
                  },
                  {
                    data: myConvertData(res.data, ((this.aqiValue - 45.06) / 12) * 9)
                  },
                  {
                    renderItem: renderItem
                  },
                  {
                    data: pointConvertData(this.pointData.data1)
                  }
                ]
              },
              {
                series: [
                  {
                    data: convertData(this.mapData.data, 3)
                  },
                  {
                    data: myConvertData(res.data, ((this.aqiValue - 45.06) / 12) * 10)
                  },
                  {
                    renderItem: renderItem
                  },
                  {
                    data: pointConvertData(this.pointData.data1)
                  }
                ]
              },
              {
                series: [
                  {
                    data: convertData(this.mapData.data, 2)
                  },
                  {
                    data: myConvertData(res.data, ((this.aqiValue - 45.06) / 12) * 11)
                  },
                  {
                    renderItem: renderItem
                  },
                  {
                    data: pointConvertData(this.pointData.data1)
                  }
                ]
              },
              {
                series: [
                  {
                    data: convertData(this.mapData.data, 1)
                  },
                  {
                    data: myConvertData(res.data, ((this.aqiValue - 45.06) / 12) * 12)
                  },
                  {
                    renderItem: renderItem
                  },
                  {
                    data: pointConvertData(this.pointData.data1)
                  }
                ]
              }
            ]
          };
          if (option && typeof option === 'object') {
            this.myChart.setOption(option);
          }
        })

      })
    }
  },
  computed: {
    dataChange: function () {
      const {mapCenter, mapZoom, mapCoords, mapData, aqiValue, pointData} = this;
      return {mapCenter, mapZoom, mapCoords, mapData, aqiValue, pointData}
    },
  }
}
</script>

<style scoped>
.BMap_cpyCtrl {
  display: none;
}

.anchorBL {
  display: none;
}
</style>